# 增删改语句

INSERT INTO `T_user`(`username`, `password`, `name`, `sex`, `age`, `class_id`, `type`)
VALUES ('aliz', 'HaiLuo', '海螺', '女', 19, null, 0),
	   ('tomoto', 'FanQie', '番茄', '男', 21, null, 1),
       ('sheep_realms', 'MianYang', '绵羊', '女', 18, 1, 2),
       ('a10001', '123456', '马云', '男', 56, null, 0 ),
       ('a10002', '456789', '马化腾', '男', 49, null, 0),
       ('a10003', '111111', '李彦宏', '男', 52, null, 0),
       ('a10004', '222222', '周鸿祎', '男', 50, null, 0),
       ('t10005', 't12345', '俞敏洪', '男', 58, null, 1),
       ('t10006', 't45678', '雷军', '男', 51, null, 1),
       ('t10007', 't11111', '任正非', '男', 76, null, 1),
       ('t10008', 't22222', '史蒂夫·乔布斯', '男', 56, null, 1),
       ('t10009', 't33333', '卢伟冰', '男', 45, null, 1),
       ('t10010', 't44444', '张平安', '男', 48, null, 1),
       ('t10011', 't55555', '陈明永', '男', 51, null, 1),
       ('s10012', 's66666', '景天', '男', 20, 1, 2),
       ('s10013', 's77777', '唐雪见', '女', 19, 1, 2),
       ('s10014', 's88888', '徐长卿', '男', 27, 1, 2),
       ('s10015', 's99999', '紫萱', '女', 25, 1, 2),
       ('s10016', 's23456', '龙葵', '女', 18, 1, 2),
       ('s10017', 's59357', '重楼', '男', 30, 2, 2),
       ('s10018', 's89456', '徐茂山', '男', 21, 2, 2),
       ('s10019', 's56123', '清微', '男', 70, 2, 2),
       ('s10020', 's47258', '邪剑仙', '男', 53, 2, 2);

INSERT INTO `T_homework`(`teacher_id`, `title`, `describe`, `class_id`, `end_time`, `attach_title`, `attach_url`)
VALUES(1, '语文', '大学一年级', 1, '2020-12-15', '课后作业', 'E://11.txt'),
      (1, '语文', '大学一年级', 2, '2020-12-15', '课后作业', 'E://11.txt'),
      (1, '语文', '大学一年级', 3, '2020-12-15', '课后作业', 'E://11.txt'),
      (2, '数学', '大学一年级', 1, '2020-12-15', '课后作业', 'E://22.txt'),
      (2, '数学', '大学一年级', 2, '2020-12-15', '课后作业', 'E://22.txt'),
      (2, '数学', '大学一年级', 3, '2020-12-15', '课后作业', 'E://22.txt'),
      (3, '英语', '大学一年级', 1, '2020-12-15', '课后作业', 'E://33.txt'),
      (3, '英语', '大学一年级', 2, '2020-12-15', '课后作业', 'E://33.txt'),
      (3, '英语', '大学一年级', 3, '2020-12-15', '课后作业', 'E://33.txt');

INSERT INTO `T_student_homework`(`hw_id`, `s_id`, `title`, `describe`, `status`, `review_content`,`review_time`,`attach_title`, `attach_url`)
VALUES(1, 1, '语文', '大学一年级', '已批改', '很好', '2020-12-16', '语文课后作业', 'E://1.txt'),
      (1, 2, '语文', '大学一年级', '未批改', null, null, '语文课后作业', 'E://11.txt'),
      (1, 3, '语文', '大学一年级', '已批改', '还行', '2020-12-16', '语文课后作业', 'E://22.txt'),
      (2, 1, '数学', '大学一年级', '已批改', '不错', '2020-12-17', '数学课后作业', 'E://1.txt'),
      (2, 2, '数学', '大学一年级', '已批改', '一般', '2020-12-17', '数学课后作业', 'E://1.txt'),
      (2, 3, '数学', '大学一年级', '未批改', null, null, '数学课后作业', 'E://22.txt'),
      (3, 1, '英语', '大学一年级', '未批改', null, null, '英语课后作业', 'E://1.txt'),
      (3, 2, '英语', '大学一年级', '已批改', '继续努力', '2020-12-18', '英语课后作业', 'E://11.txt'),
      (3, 3, '英语', '大学一年级', '已批改', '加油', '2020-12-18', '英语课后作业', 'E://22.txt');

INSERT INTO `T_class`(`classNo`, `className`)
VALUES(c1,a-1),
      (c2,a-2),
      (c3,a-3);

INSERT INTO `T_notice`(`title`, `content`, `create_time`)
VALUES('通知', '请同学按时提交作业,作业的情况将会被记录期末测评', '2020-12-15'),
      ('通知', '请老师能够及时给学生批改作业，并且给出相对意见', '2020-12-14');

INSERT INTO `T_message`(`title`, `content`, `create_time`)
VALUES('雷军老师你好,我是景天', '关于今天英语阅读理解我还有点不懂,希望可以重新讲一遍', '2020-12-19'),
      ('景天同学你好,我是雷军老师', '英语阅读理解，明天上课我会再讲一遍，不用担心', '2020-12-19'),
      ('任正非老师你好,我是重楼', '关于今天数学的计算题,解题思路能否给我讲一下'),
      ('重楼同学你好,我是任正非老师', '数学计算题的思路是这样的:……'),