# 增删改语句

INSERT INTO `T_user`(`username`, `password`, `name`, `sex`, `age`, `class_id`, `type`)
VALUES ('aliz', 'HaiLuo', '海螺', '女', 19, null, 0),
	   ('tomoto', 'FanQie', '番茄', '男', 21, null, 1),
       ('sheep_realms', 'MianYang', '绵羊', '女', 18, 1, 2),
       ('a10001', '123456', '马云', '男', 56, null, 0 ),
       ('a10002', '456789', '马化腾', '男', 49, null, 0),
       ('a10003', '111111', '李彦宏', '男', 52, null, 0),
       ('a10004', '222222', '周鸿祎', '男', 50, null, 0),
       ('t10005', 't12345', '俞敏洪', '男', 58, null, 1),
       ('t10006', 't45678', '雷军', '男', 51, null, 1),
       ('t10007', 't11111', '任正非', '男', 76, null, 1),
       ('t10008', 't22222', '史蒂夫·乔布斯', '男', 56, null, 1),
       ('t10009', 't33333', '卢伟冰', '男', 45, null, 1),
       ('t10010', 't44444', '张平安', '男', 48, null, 1),
       ('t10011', 't55555', '陈明永', '男', 51, null, 1),
       ('s10012', 's66666', '景天', '男', 20, 1, 2),
       ('s10013', 's77777', '唐雪见', '女', 19, 1, 2),
       ('s10014', 's88888', '徐长卿', '男', 27, 1, 2),
       ('s10015', 's99999', '紫萱', '女', 25, 1, 2),
       ('s10016', 's23456', '龙葵', '女', 18, 1, 2),
       ('s10017', 's59357', '重楼', '男', 30, 2, 2),
       ('s10018', 's89456', '徐茂山', '男', 21, 2, 2),
       ('s10019', 's56123', '清微', '男', 70, 2, 2),
       ('s10020', 's47258', '邪剑仙', '男', 53, 2, 2);

INSERT INTO `T_homework`(`teacher_id`, `title`, `describe`, `class_id`, `end_time`, `attach_title`, `attach_url`)
VALUES(1, '语文', '大学一年级', 1, '2020-12-15', '课后作业', 'E://11.txt'),
      (2, '数学', '大学一年级', 1, '2020-12-15', '课后作业', 'E://22.txt'),
      (3, '英语', '大学一年级', 1, '2020-12-15', '课后作业', 'E://33.txt');